Repository: thorrak/brewflasher
Catalog: locales/*/LC_MESSAGES/brewflasher.po
Languages: de

source: BrewFlasher is translated by users like you! If you can suggest any improvements please create an issue on GitHub at http://github.com/thorrak/brewflasher/issues/
de: BrewFlasher wird von Nutzern wie Ihnen übersetzt! Wenn Sie Verbesserungsvorschläge haben, erstellen Sie bitte ein Issue auf GitHub unter http://github.com/thorrak/brewflasher/issues/

source: Auto-select
de: Automatisch auswählen

source: (first port with Espressif device)
de: (erster Port mit Espressif-Gerät)

source: Must select the project, device family, and firmware to flash before flashing.
de: Projekt, Gerätefamilie und Firmware müssen vor dem Flashen ausgewählt werden.

source: Verifying firmware list is up-to-date before downloading...
de: Überprüfe die Firmware-Liste, bevor der Download startet...

source: Firmware list is not up to date.
de: Firmware-Liste ist nicht aktuell.

source: Relaunch BrewFlasher and try again.
de: Starte BrewFlasher neu und versuche es erneut.

source: Downloading firmware...
de: Firmware wird heruntergeladen...

source: Error - unable to download firmware.
de: Fehler - Firmware kann nicht heruntergeladen werden.

source: Downloaded successfully!
de: Download abgeschlossen!

source: Invalid device family detected.
de: Gerätefamilie nicht unterstützt.

source: ERROR - Cannot automatically select the serial port for this device family. Please explicitly select the correct device to continue.
de: FEHLER – Die serielle Schnittstelle für diese Gerätefamilie konnte nicht automatisch erkannt werden. Wählen Sie das korrekte Gerät aus, um fortzufahren.

source: Invalid flash method detected. Update BrewFlasher and try again.
de: Ungültige Flash-Methode erkannt. Aktualisieren Sie BrewFlasher und versuchen Sie es erneut.

source: Performing 1200 bps touch
de: 1200 Bit/s Ping wird ausgeführt

source: ...done
de: ...fertig

source: ...unable to perform 1200bps touch.
de: ...1200 Bit/s Ping konnte nicht ausgeführt werden.

source: Make sure you have selected the correct serial port (auto-select will not work for this chip) and try again.
de: Stellen Sie sicher, dass Sie den richtigen seriellen Port ausgewählt haben (automatische Auswahl funktioniert nicht für diesen Chip) und versuchen Sie es erneut.

source: Alternatively, you may need to manually set the device into 'flash' mode.
de: Alternativ müssen sie das Gerät in den Flash-Modus ändern.

source: For instructions on how to do this, check this website: http://www.brewflasher.com/manualflash/
de: Für Anweisungen, wie man dies macht, ist diese Website hilfreich: http://www.brewflasher.com/manualflash/

source: Firmware flashing FAILED. {tool} raised an error.
de: Firmware Flash fehlgeschlagen. {tool} meldet einen Fehler.

source: Try flashing again, or try flashing with a slower speed.
de: Versuch den Flash nochmal, oder Flashe mit einer langsameren Geschwindigkeit.

source: Firmware successfully flashed. Reset device to switch back to normal boot mode.
de: Firmware erfolgreich geflasht. Starte das Gerät neu, um zum normalen Boot-Modus zurückzukehren.

source: Connect your device
de: Verbinde das Gerät

source: If you chose the serial port auto-select feature you might need to turn off Bluetooth
de: Wenn Sie die automatische Auswahl der seriellen Schnittstelle ausgewählt haben, muss Bluetooth möglicherweise deaktiviert sein

source: Avrdude was not found. Arduino firmware cannot be flashed.
de: Avrdude wurde nicht gefunden. Arduino-Firmware kann nicht geflasht werden.

source: To install Avrdude, follow the instructions at https://github.com/avrdudes/avrdude/
de: Um Avrdude zu installieren, folgen Sie den Anweisungen unter https://github.com/avrdudes/avrdude/

source: Reload serial device list
de: Schnittstellengeräteliste neu laden

source: no
de: Nein

source: yes, wipes all data
de: Ja (alle Daten werden gelöscht)

source: Download Firmware and Flash Controller
de: Firmware und Flash-Controller herunterladen

source: Serial port
de: Serielle Schnittstelle

source: Project
de: Projekt

source: Device Family
de: Gerätefamilie

source: Erase flash
de: Flash löschen

source: Console
de: Konsole

source: Welcome to BrewFlasher {version}
de: Willkommen zu BrewFlasher {version}

source: Exit BrewFlasher
de: BrewFlasher beenden

source: About
de: Info
